import QtQml 2.15

// Ручная карта 6. Строки идут сверху вниз; символы описаны в LEARNING_02.md.
QtObject {
    readonly property var rows: [
        "####################",
        "#.C$C...C$C....C$C.#",
        "#.##CCC.#C#..CCC##.#",
        "#.#C$C#.#C#.##C$C#.#",
        "#.##C$#.#$#.#$CC##.#",
        "#..#CC###C####CC...#",
        "#..#CC..#C#...CC#..#",
        "#..#$#..#C#...##...#",
        "#..###..#C#........#",
        "#..#$####C######...#",
        "#..######C######...#",
        "#XxP.....#.......xX#",
        "####################"
    ]
}
